const MemorableDatesPage = () => {
  return (
    <div className="py-5 max-w-[1200px] m-auto">
      <table>
        <tr>
          <th>Дата</th>
          <th>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</th>
          <th>Подія</th>
        </tr>
        <tr>
          <td>1 липня 1900 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Відкриття в Олександрівську першого в Україні середнього
            семикласного механіко-технічного училища
          </td>
        </tr>
        <tr>
          <td>29 липня 1900 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Директором училища призначений Поддерьогін Денис Михайлович, який
            очолював його до 1918 р.
          </td>
        </tr>
        <tr>
          <td>1906 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Відбувся перший випуск фахівців в училищі. Серед них був Влас Чубар,
            який став потім видатним державним і політичним діячем
          </td>
        </tr>
        <tr>
          <td>Липень 1917 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Училище перетворене на 4-класне середнє</td>
        </tr>
        <tr>
          <td>1920 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Училище реорганізоване в індустріальний технікум (з правами вузу)
          </td>
        </tr>
        <tr>
          <td>1923 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            При технікумі відкрито сільгоспвідділення, яке готувало агрономів
          </td>
        </tr>
        <tr>
          <td>11 лютого 1924 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Наркомат освіти України присвоїв Запорізькому індустріальному
            технікуму імені В.Я. Чубаря
          </td>
        </tr>
        <tr>
          <td>Серпень 1941 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Інститут евакуйований до Барнаула Алтайського краю</td>
        </tr>
        <tr>
          <td>27 березня 1944 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Інститут поновив роботу після визволення Запоріжжя від
            німецько-фашистських загарбників
          </td>
        </tr>
        <tr>
          <td>31 липня 1944 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            На базі інституту сільгоспмашинобудування створено Запорізький
            автомеханічний інститут, з факультетами: ливарного виробництва,
            сільгоспмашинобудування, автотракторним. Директором був призначений
            доц. М.І. Бодзич, який працював на цій посаді до 1957 р.
          </td>
        </tr>
        <tr>
          <td>1947 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Інститут перейменований у Запорізький інститут
            сільськогосподарського машинобудування
          </td>
        </tr>
        <tr>
          <td>1948 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Створене вечірне відділення інституту</td>
        </tr>
        <tr>
          <td>1955 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Автотракторний факультет перейменований на автомеханічний</td>
        </tr>
        <tr>
          <td>1957 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Факультет сільгоспмашинобудування перейменований на машинобудівний
          </td>
        </tr>
        <tr>
          <td>1957 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Ректором інституту призначений доц. (затим – проф.) П.А. Михайлов,
            який працював на цій посаді до 1978 р.
          </td>
        </tr>
        <tr>
          <td>1959 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>У ЗМІ відкрита аспірантура</td>
        </tr>
        <tr>
          <td>Березень 1960 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Перший випуск багатотиражної газети «Інженер-машинобудівник»</td>
        </tr>
        <tr>
          <td>1961 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Створений електротехнічний факультет</td>
        </tr>
        <td>1962 р.</td>
        <td>&nbsp;&nbsp;&nbsp;</td>
        <td>Створений загальнотехнічний факультет</td>
        <tr>
          <td>1968 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Створений факультет електронної техніки</td>
        </tr>
        <tr>
          <td>1969 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Створене підготовче відділення з денною і вечірньою формами навчання
          </td>
        </tr>
        <tr>
          <td>1978 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Ректором ЗМІ призначений дтн, проф. В.С. Попов, який працював на цій
            посаді до лютого 1993 р.
          </td>
        </tr>
        <tr>
          <td>29 квітня 1980 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            ЗМІ за велику роботу з підготовки кадрів для народного господарства
            нагороджений орденом «Знак пошани»
          </td>
        </tr>
        <tr>
          <td>1980 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            В інституті відкрита спеціалізована вчена рада із захисту
            кандидатських дисертацій зі спеціальностей: матеріалознавство у
            машинобудуванні, механіка деформованого твердого тіла
          </td>
        </tr>
        <tr>
          <td>1986 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Загальнотехнічний факультет реорганізований у факультет заочного
            навчання
          </td>
        </tr>
        <tr>
          <td>1987 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Відкритий спецфакультет з перепідготовки кадрів</td>
        </tr>
        <tr>
          <td>1989 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Факультет електронної техніки перейменований на радіоприладобудівний
          </td>
        </tr>
        <tr>
          <td>1989 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Створене спільне українсько-болгарське підприємство «Інтерсистема»
          </td>
        </tr>
        <tr>
          <td>1990 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            ЗМІ надано право приймати на навчання, стажування та в аспірантуру
            іноземних громадян за прямими угодами
          </td>
        </tr>
        <tr>
          <td>1993 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Створений факультет заочного і довузівського навчання</td>
        </tr>
        <tr>
          <td>1993 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Ректором ЗМІ призначений дтн, проф. П.Г. Краснокутський, який
            працював на цій посаді до серпня 1997 р.
          </td>
        </tr>
        <tr>
          <td>20 квітня 1994 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            На базі ЗМІ ім. В.Я. Чубаря створений Запорізький державний
            технічний університет
          </td>
        </tr>
        <tr>
          <td>1994 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Організований факультет економіки і управління</td>
        </tr>
        <tr>
          <td>1994 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Автомобільний факультет перейменований на автомеханічний</td>
        </tr>
        <tr>
          <td>1994 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Відкрита спеціалізована вчена рада із захисту докторських дисертацій
            зі спеціальності«Матеріалознавство у машинобудуванні»
          </td>
        </tr>
        <tr>
          <td>1995 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Створена університетська комп'ютерна друкарня</td>
        </tr>
        <tr>
          <td>1995 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Спецфакультет з перепідготовки кадрів перейменований на факультет
            післядипломної освіти
          </td>
        </tr>
        <tr>
          <td>1997 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Ректором ЗДТУ призначений д.т.н. С.Б. Бєліков</td>
        </tr>
        <tr>
          <td>2000 р. (19 листопада)</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Університету виповнилось 100 років</td>
        </tr>
        <tr>
          <td>2001 р. (7 серпня)</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Згідно Указу Президента України, враховуючи загальнодержавне і
            міжнародне визнання результатів діяльності та вагомий внесок у
            розвиток національної освіти і науки Запорізькому державному
            технічному університету надано статус «національний» і надалі
            іменується «Запорізький національний технічний університет»
          </td>
        </tr>
        <tr>
          <td>2001 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Конференція трудового колективу затвердила перший Статут
            Запорізького національного технічного університету
          </td>
        </tr>
        <tr>
          <td>січень 2002 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Відкриття навчального відділення «Освіта для бізнесу»</td>
        </tr>
        <tr>
          <td>травень 2002 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            На базі ЗНТУ пройшли загальні збори Спілка ректорів України за
            участі 200 керівників та міністра освіти і науки В.Т. Кременя
          </td>
        </tr>
        <tr>
          <td>2002 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Створений гуманітарний факультет</td>
        </tr>
        <tr>
          <td>2002 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Створений факультет інформатики та обчислювальної техніки</td>
        </tr>
        <tr>
          <td>грудень 2002 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Наказом міністра освіти і науки України Бєліков С.Б. на умовах
            контракту призначений ректором на період 2002-2009 рр.
          </td>
        </tr>
        <tr>
          <td>2003 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Відкриття меморіальної дошки першому ректору «Машинки» Михайлову
            П.А. і лабораторії на його честь
          </td>
        </tr>
        <tr>
          <td>2004 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Проведення першого університетського «Балу аеробіки»</td>
        </tr>
        <tr>
          <td>2004 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            До складу ЗНТУ в якості структурних підрозділів увійшли Запорізький
            електротехнічний коледж та Запорізький коледж радіоелектроніки
          </td>
        </tr>
        <tr>
          <td>2007 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Створений Інститут управління і права з трьома факультетами</td>
        </tr>
        <tr>
          <td>2007 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Укладено та підписано угоду про співпрацю між Уханським
            політехнічним університетом (Китайська Народна Республіка) та ЗНТУ
          </td>
        </tr>
        <tr>
          <td>2007 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>До складу ЗНТУ увійшов Бердянський машинобудівний коледж</td>
        </tr>
        <tr>
          <td>2010 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            ЗНТУ удостоєний Диплома лауреата громадської акції «Флагмани освіти
            і науки України» та Диплома Гран-Прі «Лідер вищої освіти України»
          </td>
        </tr>
        <tr>
          <td>2010 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Міністр освіти і науки України Д.В. Табачник підписав контракт з
            ректором ЗНТУ Бєліковим С.Б. на 2010-2015 рр.
          </td>
        </tr>
        <tr>
          <td>2010 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Святкування 110-річниці ЗНТУ</td>
        </tr>
        <tr>
          <td>2012 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            ФРТ перейменовано на факультет радіоелектроніки та телекомунікацій
          </td>
        </tr>
        <tr>
          <td>2012 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>ЗНТУ отримав два гранти в проектах програми ТЕМПУС</td>
        </tr>
        <tr>
          <td>2013 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>ІОТ перейменовано у факультет комп'ютерних наук і технологій</td>
        </tr>
        <tr>
          <td>2015 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Ректором ЗНТУ обрано Бєлікова С.Б. на 2015-2020 рр.</td>
        </tr>
        <tr>
          <td>2015 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Університет відсвяткував 115-річницю від дня свого заснування</td>
        </tr>
        <tr>
          <td>жовтень 2016 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Відкриття Музею історії технічного прогресу</td>
        </tr>
        <tr>
          <td>2016 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Створений юридичний факультет Інституту управління та права
            Національного університету «Запорізька політехніка»
          </td>
        </tr>
        <tr>
          <td>2016 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Створений факультет соціальних наук</td>
        </tr>
        <tr>
          <td>2016 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Пройшов перший з'їзд Асоціації випускників ЗМІ – ЗДТУ – ЗНТУ</td>
        </tr>
        <tr>
          <td>2017 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>Створений факультет будівництва, архітектури та дизайну</td>
        </tr>
        <tr>
          <td>2017 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Збірна команда ЗНТУ зайняла перше командне місце у Всеукраїнській
            універсіаді. На чемпіонаті Європи в Італії збірна ЗНТУ по спортивній
            аеробіці стала бронзовим призером
          </td>
        </tr>
        <tr>
          <td>жовтень 2017 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Відкриття лабораторії динамічних досліджень процесу розвитку різання
            з новітніми станками та лабораторії авіаційних технологій
          </td>
        </tr>
        <tr>
          <td>квітень 2019 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>ЗНТУ перейменований на НУ «Запорізька політехніка»</td>
        </tr>
        <tr>
          <td>2020 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>НУ «Запорізька політехніка» виповнилося 120 років </td>
        </tr>
        <tr>
          <td>2022 р.</td>
          <td>&nbsp;&nbsp;&nbsp;</td>
          <td>
            Ректором НУ «Запорізька політехніка» призначений канд. техн. наук,
            професор В.Л. Грешта
          </td>
        </tr>
      </table>
    </div>
  );
};

export default MemorableDatesPage;
