import { President } from "../interface";

const presidents: President[] = [
  {
    id: 1,
    name: "ПОДДЕРЬОГІН Денис Миколайович",
    title:
      "Директор Олександрівського механіко-технічного училища (1900–1918).",
    imageUrl: "src/assets/PoddierioginDM.jpg",
    description: `Денис Миколайович Поддєрьогін закінчив Санкт-Петербурзький технологічний інститут, отримавши кваліфікацію інженера-технолога. Після цього до 1895 року працював інспектором Одеської школи десятників з будівельної справи. Д.М. Поддєрьогін обіймав посаду першого інспектора Ніжинського ремісничого училища до 1898 року. За час діяльності його було нагороджено орденами Святого Станіслава II та III ступенів.`,
  },
  {
    id: 2,
    name: "ПАВЛЮК Антон Маркович",
    title:
      "Директор Олександрівського трирічного індустріального технікуму (1920–1925).",
    imageUrl: "src/assets/PavliukAM.jpg",
    description: `Народився Антон Маркович Павлюк у 1882 році в селі Кагарлик Ніжинського повіту Чернігівської губернії в селянській родині. У 1909 році став випускником Олександрівського середньо-технічного училища і продовжив навчання в Харківському технологічному інституті на механічному відділенні, яке закінчив у 1916 році з відзнакою та отримав звання інженера-технолога. Антон Маркович Павлюк повернувся в рідне училище, працював викладачем спеціальних дисциплін та української мови. У 1918 році був призначений директором Олександрівського середнього механіко-технічного училища, а в 1920 році – Олександрівського трирічного індустріального технікуму. Викладав математику, фізику та спеціальні дисципліни в різних навчальних школі ім. Г.С. Сковороди й трудовій школі імені Бориса Грінченка. Був інспектором Наркомосу УРСР. Викладав у Харківському інституті інженерів залізничного транспорту.`,
  },
  {
    id: 3,
    name: "ЛЬОВОЧКІН Сергій Микитович",
    title:
      "Директор Олександрівського трирічного індустріального технікуму (1925–1927).",
    imageUrl: "src/assets/LiovochkinSM.jpg",
    description: `Сергій Микитович Льовочкін закінчив Новоолександрівський інститут сільського господарства, отримавши диплом ученого агронома I розряду. Упродовж 1916–1924 років як колезький радник обіймав посаду директора Ніжинського технічного училища. За його ініціативи на засіданні педагогічної ради училища розглядали ставлення Генерального секретаріату Української Центральної Ради від 10 серпня 1917 року до викладання української мови та українознавства в училищі. Після винесеного рішення з 12 жовтня 1917 року в навчальному закладі почали читати ці предмети.`,
  },
  {
    id: 4,
    name: "ЗАЙДЕЛЬ Наум Соломонович",
    title:
      "Директор Олександрівського трирічного індустріального технікуму (1928–1932).",
    imageUrl: "src/assets/ZaydelNS.jpg",
    description: `Народився Наум Соломонович Зайдель у 1897 році в Білій Церкві Київської області. У 1929 році був призначений директором технікуму, який реорганізували в інститут сільгоспмашинобудування в 1930 році для підготовки інженерів за чотирма спеціальностями: «Тракторна справа», «Сільськогосподарська справа», «Обробка металів» і «Ливарна справа». За часів керівництва Наума Соломоновича зведено третій поверх головного корпусу інституту, побудовано два гуртожитки та будинок для викладачів. Відбувалося відновлення старих лабораторій, а також створювали нові – хімічну й механічну. Пізніше було відкрито читальний зал.`,
  },
  {
    id: 5,
    name: "ФІЛАТОВ Ф. Й.",
    title:
      "Директор Запорізького інституту сільськогосподарського машинобудування (1932–1935).",
    imageUrl: "src/assets/FilatovFY.jpg",
    description: `Під керівництвом Філатова Ф.Й. були створені нові кафедри ковальсько-штампувального й пресового виробництва, фізматематики, прикладної механіки, опору матеріалів, деталей машин, сільськогосподарського машинобудування, енергетики, чавунного виробництва, обробки металів різанням, соціально-економічних дисциплін та інших. З 1 березня 1935 року в Інституті почали проводити військову підготовку студентів. Вони навчалися та проходили практику на базі заводів «Комунар» та Краматорського заводу важкого машинобудування. Студенти надавали допомогу заводській молоді в підвищенні їх загальноосвітнього рівня. Філатовим Ф.Й. було організовано підготовчі курси для осіб, які планували вступити до навчального закладу.`,
  },
  {
    id: 6,
    name: "ІСАКОВ Леонід Георгійович",
    title:
      "Директор Запорізького інституту сільськогосподарського машинобудування (1935–1944).",
    imageUrl: "src/assets/IsakovLG.jpg",
    description: `Народився Ісаков Леонід Георгійович у 1898 році в Петербурзі (Росія). Навчався в Петербурзькому хімічному хіміко-технологічному училищі. Коли почалася Перша світова війна, був призваний до армії. У 1918 році потрапив до Військової школи в Омську. У 1921 році відряджений до Вищої кавалерійської школи в Петрограді, яку закінчив у 1923 році. Був направлений начальником оперативної частини штабу 6-ї Новочеркаської кавалерійської дивізії (м. Гомель). Упродовж 1925–1929 років працював начальником штабу, а потім начальником оперативної частини 5-го кавалерійського полку. З травня 1929 року по серпень 1930 року обіймав посаду начальника штабу «Червоної зірки» у місті Ленінград (РФСР). У 1930 році відряджений на навчання до Військової академії ім. М.В. Фрунзе. У 1933 році інженер-хімік Л.Г. Ісаков призначений директором Глиноземного заводу Дніпровського алюмінієвого комбінату.`,
  },
  {
    id: 7,
    name: "БОДЗИЧ Мануїл Йосипович",
    title:
      "Директор Запорізького інституту сільськогосподарського машинобудування (1944–1957)",
    imageUrl: "src/assets/BodzychMY.jpg",
    description: `Народився Бодзич Мануїл Йосипович у 1904 році в Білорусі. У 1915 році сім'я переїхала в місто Орел, що в Росії, де він спочатку працював слюсарем з ремонту машин. Вступивши до інституту, роботу не покинув. Успішно закінчив Московський машинобудівний інститут. У 1944 році М.Й. Бодзича призначили директором Запорізького інституту сільськогосподарського машинобудування. Маючи добрі знання й досвід, а також організаторські здібності, Мануїл Йосипович зумів у тяжкі післявоєнні роки згуртувати колектив інституту з метою виконання поставлених завдань, налагодити навчальний процес.`,
  },
  {
    id: 8,
    name: "МИХАЙЛОВ Павло Андрійович",
    title: "Ректор Запорізького машинобудівного інституту (1957–1978).",
    imageUrl: "src/assets/MykhaylovPA.jpg",
    description: `Народився Михайлов Павло Андрійович 21 грудня 1911 року в Курську в робітничо-селянській родині. Трудовий шлях почав у 13 років (різноробочий, тракторист, помічник коваля), поєднуючи роботу з навчанням у школі. Після закінчення школи з 1927 року працював креслярем, конструктором, технологічним керівником інструментального цеху.`,
  },
  {
    id: 9,
    name: "ФІЛАТОВ Ф. Й.",
    title:
      "Директор Запорізького інституту сільськогосподарського машинобудування (1932–1935).",
    imageUrl: "src/assets/FilatovFY.jpg",
    description: `Під керівництвом Філатова Ф.Й. були створені нові кафедри ковальсько-штампувального й пресового виробництва, фізматематики, прикладної механіки, опору матеріалів, деталей машин, сільськогосподарського машинобудування, енергетики, чавунного виробництва, обробки металів різанням, соціально-економічних дисциплін та інших. З 1 березня 1935 року в Інституті почали проводити військову підготовку студентів. Вони навчалися та проходили практику на базі заводів «Комунар» та Краматорського заводу важкого машинобудування. Студенти надавали допомогу заводській молоді в підвищенні їх загальноосвітнього рівня. Філатовим Ф.Й. було організовано підготовчі курси для осіб, які планували вступити до навчального закладу.`,
  },
  {
    id: 10,
    name: "Грешта Віктор Леонідович",
    imageUrl: "src/assets/GreshtaVL.jpg",
    description: `Грешта Віктор Леонідович (народився 13 лютого 1974 року в м. Запоріжжя) – кандидат технічних наук, професор, ректор НУ «Запорізька політехніка» з 2022 року. Відзначений Подякою Президента України, нагороджений нагрудними знаками «Відмінник освіти України» та «За наукові та освітні досягнення».
    Випускник Запорізького державного технічного університету (1996) за спеціальністю «Матеріалознавство в машинобудуванні». Кандидатська дисертація «Металознавство та термічна обробка металів» (2004). З 2006 року доцент, а з 2015 професор кафедри фізичного матеріалознавства.`,
  },
];

export default presidents;
